doctorReimbursement_interface/查询补偿记录

<E:Envelope
	xmlns:E="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:A="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:s="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:y="http://www.w3.org/2001/XMLSchema"
	E:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<E:Body>
<m:nh_interface
	xmlns:m="http://tempuri.org/">
<m:String_input
	s:type="y:string">yy_yyx@#100000033@$6588@!0Of4&lt;;;3:6@!刘庆团@!|tceles *&#xd;
  from (|tceles |rahc_ot(cyrq, &apos;yyyy&apos;) as nd,&#xd;
               b.bcjgmc as hospital_name,&#xd;
               a.hospital_id,&#xd;
               a.ywid,&#xd;
               a.id,&#xd;
               a.ywlb_son,&#xd;
               a.djhm,&#xd;
               a.ylzh,&#xd;
               a.grbm,&#xd;
               a.grmc,&#xd;
               a.djsj,&#xd;
               a.zje,&#xd;
               a.kbxfy,&#xd;
               a.tczf,&#xd;
               a.tcsjzf,&#xd;
               a.jssj,&#xd;
               a.rysj,&#xd;
               a.cyrq,&#xd;
               a.bcddm,&#xd;
               d.bcjgmc as bcdmc,&#xd;
               a.jsr,&#xd;
               a.jsrxm,&#xd;
               a.yxywbz,&#xd;
               a.serial_icd,&#xd;
               cy_jbmc disease,&#xd;
               a.jsbz,&#xd;
               &apos;0&apos; as bz,&#xd;
               zcbfzf,&#xd;
               a.dbbcje,&#xd;
               (|tceles hgfy&#xd;
                  from v_dbzb_dyybw t&#xd;
                 |erehw a.hospital_id = t.hospital_id&#xd;
                   and a.ywid = t.ywid&#xd;
                   and a.id = t.id) hgfy,&#xd;
               a.thbbcje,&#xd;
               a.mzjzzf,&#xd;
               a.czddje,&#xd;
               a.yyjmje&#xd;
          from yw_dyywb a, v_bcjg b, v_bcjg d&#xd;
         |erehw a.hospital_id = b.bcjgdm(+)&#xd;
           and a.bcddm = d.bcjgdm(+)&#xd;
           and a.grbm = :ls_grbm&#xd;
        union&#xd;
        |tceles nd,&#xd;
               b.bcjgmc as hospital_name,&#xd;
               a.hospital_id,&#xd;
               a.ywid,&#xd;
               a.id,&#xd;
               a.ywlb_son,&#xd;
               a.djhm,&#xd;
               a.ylzh,&#xd;
               a.grbm,&#xd;
               a.grmc,&#xd;
               a.djsj,&#xd;
               a.zje,&#xd;
               a.kbxfy,&#xd;
               a.tczf,&#xd;
               a.tcsjzf,&#xd;
               a.jssj,&#xd;
               a.rysj,&#xd;
               a.cyrq,&#xd;
               a.bcddm,&#xd;
               d.bcjgmc as bcdmc,&#xd;
               a.jsr,&#xd;
               a.jsrxm,&#xd;
               a.yxywbz,&#xd;
               a.serial_icd,&#xd;
               cy_jbmc disease,&#xd;
               a.jsbz,&#xd;
               &apos;1&apos; as bz,&#xd;
               0 as zcbfzf,&#xd;
               a.dbbcje,&#xd;
               (|tceles hgfy&#xd;
                  from v_dbzb_dyybw t&#xd;
                 |erehw a.hospital_id = t.hospital_id&#xd;
                   and a.ywid = t.ywid&#xd;
                   and a.id = t.id) hgfy,&#xd;
               a.thbbcje,&#xd;
               a.mzjzzf,&#xd;
               a.czddje,&#xd;
               a.yyjmje&#xd;
          from yw_dyywb_ls a, v_bcjg b, v_bcjg d&#xd;
         |erehw a.hospital_id = b.bcjgdm(+)&#xd;
           and a.bcddm = d.bcjgdm(+)&#xd;
           and a.grbm = :ls_grbm)&#xd;
 order by nd, jssj desc@!:ls_grbm@!721666685</m:String_input>
</m:nh_interface>
</E:Body>
</E:Envelope>




<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nh_interfaceResponse xmlns="http://tempuri.org/"><nh_interfaceResult>0@!@$
2013	城关镇城关荣站二村卫生室	430621556523	26244342	1	1101	2013120024895901	4306210121011214	721666685	章怡	2013/12/16 17:09:35	24.65	24.65	15	15	2013/12/16 17:09:38	2013/12/16 0:00:00	2013/12/16 0:00:00	430621556523	城关镇城关荣站二村卫生室	6523	涂美华	3	4057	支气管肺炎	1	1	0	0			0
2013	城关镇城关荣站二村卫生室	430621556523	26226881	1	1101	2013120024881250	4306210121011214	721666685	章怡	2013/12/15 13:42:02	24.65	24.65	15	15	2013/12/15 13:42:04	2013/12/15 0:00:00	2013/12/15 0:00:00	430621556523	城关镇城关荣站二村卫生室	6523	涂美华	3	4057	支气管肺炎	1	1	0	0			0
2020	城关镇泥家湖村卫生室	430621556588	31967933	1	1101	2020090031967933	4306210121011214	721666685	章怡	2020/9/22 15:35:54	50.89	50.21	35	35	2020/9/22 17:08:08	2020/7/3 0:00:00	2020/7/3 0:00:00	430621556588	城关镇泥家湖村卫生室	6588	刘庆团	3	30221	上呼吸道感染	1	0	0.68	0		0	0	0	0
2020	城关镇泥家湖村卫生室	430621556588	31959434	1	1101	2020090031959434	4306210121011214	721666685	章怡	2020/9/20 10:35:51	50.89	50.21	35	35	2020/9/20 10:38:17	2020/5/17 0:00:00	2020/5/17 0:00:00	430621556588	城关镇泥家湖村卫生室	6588	刘庆团	3	20129	流行性感冒伴肺炎	1	0	0.68	0		0	0	0	0
2020	城关镇泥家湖村卫生室	430621556588	31958498	1	1101	2020090031958498	4306210121011214	721666685	章怡	2020/9/19 22:29:50	50.89	50.21	35	35	2020/9/19 22:30:54	2020/5/16 0:00:00	2020/5/16 0:00:00	430621556588	城关镇泥家湖村卫生室	6588	刘庆团	3	20129	流行性感冒伴肺炎	1	0	0.68	0		0	0	0	0
2020	城关镇泥家湖村卫生室	430621556588	31949374	1	1101	2020090031949374	4306210121011214	721666685	章怡	2020/9/17 15:31:21	50.89	50.21	35	35	2020/9/17 15:32:54	2020/5/15 0:00:00	2020/5/15 0:00:00	430621556588	城关镇泥家湖村卫生室	6588	刘庆团	3	20129	流行性感冒伴肺炎	1	0	0.68	0		0	0	0	0
2020	城关镇泥家湖村卫生室	430621556588	31945785	1	1101	2020090031945785	4306210121011214	721666685	章怡	2020/9/16 15:31:05	50.89	50.21	35	35	2020/9/16 15:37:34	2020/5/14 0:00:00	2020/5/14 0:00:00	430621556588	城关镇泥家湖村卫生室	6588	刘庆团	3	20129	流行性感冒伴肺炎	1	0	0.68	0		0	0	0	0</nh_interfaceResult></nh_interfaceResponse></soap:Body></soap:Envelope>